# Задача 1. Unit-tests
# Из курса «Python: программирование на каждый день и сверхбыстрое прототипирование» нужно протестировать программу по работе с бухгалтерией из лекции 2.1.
# Если у вас есть своё решение этой задачи, можно использовать его или использовать предложенный код в директории src этого задания.
#
# Следует протестировать основные функции по получению информации о документах, добавлении и удалении элементов из словаря.
# Рекомендации по тестам:
#
# Если у вас в функциях информация выводилась (print), то теперь её лучше возвращать (return), чтобы можно было протестировать.
# Input можно «замокать» с помощью unittest.mock.patch. Если с этим будут проблемы, то лучше переписать функции так, чтобы данные приходили через параметры.



